なんやかんやあって男友達世界
男女比が1：9などという異常事態になったとはいえ遺伝子的に組み替えられた訳でもないため闘争本能というものは幾分か男性のほうが高い
そしてどんな世界になってもゲーマー，ひいては「あそびに本気になる人間」という存在はいなくならないものである
プロゲーマーというのは男子の就労制限に引っかからない数少ない職業であり，性別に関係なく努力が報われるという構造は男子が渇望する職業であった

また企業側からしてもスペック向上や新製品の開発など市場に出回る前の最終テストに打って付けのテスターや希少な男子の広告塔の存在は喉から手が出るほど欲しいので
双方の需要が重なった結果セリーグ，パリーグ，J1，J2のように各ゲームジャンルに合わせたプロチームが乱立するようになった

転生やる夫がゲームのプロになるようです

転生神（ｔ）「おお，死んでしまうとは情けない！」
やる夫（ｙ）「なんで死んだんですかお」
ｔ「趣味」
ｙ「おい待てこら」
ｔ「それは嘘だけど，普通に転生トラック」
ｙ「だったらなんでこんなとこにいるんだお？」
ｔ「最近不審死とか事故死多いでしょ？あれっていわゆるブレイクスルーが起きる時に世界が平衡を保とうとする反応熱みたいなものでね？そのブレイクスルーを起こす候補の魂をこういう形で保護しているってわけ」
ｙ「じゃあやる夫も偉人に名を連ねるってことですかお！」
ｔ「候補のなかではドンケツだけどねー，宝くじの5等以上当たる確率くらい？」
ｙ落ち込む
ｔ「まあ，保護期間が終わったら元の世界に帰れるからそれまで転生先の世界でゆっくりしていくといいよ」
ｙ「そうですかお．．．それでどういった世界に転生ですか？よくあるナーロッパですか？」
ｔ「男友達」
ｙ「は？」
ｔ「だから男友達世界だって」
ｙ「男友達？！男友達ってあの限界集落みたいなあの男友達？！なして？！」
ｔ「だってきみの優先度低いんだもん．魂の保存さえできれば保存状態は問わないっていわれてるしねー，じゃいってらー，あ，記憶は10歳くらいで戻るようにしてあるから」
ｙ「やめろおおおお！」

ｙ「こんな記憶を10歳の誕生日に思い出してもどうすればいいのかわからんお．．．こんな世界だから引きこもってても文句言われないけども，何をするにも女の目が光ってるのは気持ちのいいもんじゃないお．．．動物園でももっとプライバシーありそうな気がするお．．．」
ｙ「でも腐っても未来．ゲームとかは見たことないスペックしてるお！N天堂はスマホサイズで持ち歩きに便利だし小さいと感じたら別売りだけどディスプレイをドッキングして大きくもできるしテレビでも遊べる！Sニーはリンゴ？窓？ｓニー？っていうくらいにはパソコンの買う時の選択肢になるし」

ｙ「男友達世界だと割と娯楽が一辺倒とかあるけどここではそうでないらしいお．制限される論調が”男子が真似したら危険”みたいな感じだから明らかなファンタジーなものは制限されにくいのかお？手のひらから火や氷が出るのを真面目に考える奴はいないしな．．．」
ｙ「とりあえず一番よかったことはN天堂が残っていたことだお．マリオの性別が変わっていようが根本は変わっていないからやっぱりあの会社覚悟ガンギマってるお」
ゲーム神「ふははは！人々を楽しませるためならんんでもやるぞぉ！」
ｙ「おかげで．．．」
幼馴染（O）「うーっす，やる夫．今日もSブラやろうぜー」
ｙ「ご近所さんや幼馴染とも良好な関係を築けているお．．．まあ時々やる夫を商品に大会見たいのが開かれているけど」
O「？」←いろんな人と遊びたい！っていう理由だけで大会開いて地元ではトップに入る実力を持ってる，強い奴が偉い！という空気を作った張本人．何か文句があるならゲームで買ってからにしろ！
ｙ（やる夫はこの家族に頭上がりそうにないなあ）〈O家族が大会のあれこれを決めてる〉

O「そういえばさー，これから遊べる回数減るかもしんねー」
ｙ「え？」
O「やる夫はさー将来多分きょーがく？ってとこにいくだろ？俺もやっぱりやる夫ともっと遊びたいから，そこに入りたいって母さんにいったんだよ．そしたらさー
O母「あなたの頭では無理です」
だってよ」
O「腹立つからそこはいって見返してやりたいんだよ」
ｙ「え？やる夫の婚約で入るって手も．．．」
O「それ母ちゃんにも言われた」
ｙ「じゃあ遊ぶ回数減らさんくても」
O「でもさー，それってズルってことじゃん．他の奴らが勉強とか頑張っているのにさー俺だけ”やる夫の知り合い”ってだけで入るのはなんか違うだろ？だから他のやつと同じやり方でやってやろうと思って」
やる夫は目の前の幼馴染のプライドを見た．こいつはだれとでも”楽しく”遊びたいのだ．正々堂々と真っ向勝負で遊びたいのだ
だから自分はここまで折れずに生きてこれたのだ
ｙ「そっか．．．じゃあ応援してるお！」
O「おう！」

O母「やる夫と一緒に共学に行きたい？今のあなたの実力じゃ無理です．しかしその覚悟が本物なら私は全力でサポートします．泣き言はききませんよ．小学校の卒業式までに答えを出しなさい」


幼馴染は短期的とはいえ将来を見ている
その事実はやる夫を奮起させた
何か自分もやらなければ，そういう気持ちにさせられた

ｙ「にしてもなあ，この世界で男ができることって何があるお？幸いゲーム大会のおかげで学区ないで仲は悪いわけではないから制限が緩いとはいえグレーゾーンをフラフラしているだけだしなあ」
ｙ「勉強も嫌いではないけどむしろ社会人になって意欲が湧いてきたけどこの世界だと勉強してるだけでも白い目で見られたりするからなあ．そりゃ変に知識つけられると困るっていうのもわからなくもないけど．．．」
熱意はある，時間もある．けれども何をすればいいかわからない
そういったモヤモヤがやる夫の頭を覆っていた

そんなモヤモヤを抱えたまま中学に入学したやる夫であるが中学ともなれば小学校以上の範囲から生徒が集まるようになる
さらには幼馴染も共学対策のためやる夫と関わる時間が少なくなってしまった
今までは幼馴染が”ゲームで勝つ”という防波堤があったためそこまでやる夫の負担になっていなかったのだが，中学ではそうはいかない
同じ学区から上がった友人知人はそのルールに従い，幼馴染が手を出していないなら，とやる夫に対する干渉を最低限にしてくれたのだが他学区出身のものはそうはいかない．そもそもそのルールを知らないのだ
そういったものたちからはやる夫のいる学区の人間は餌を目の前にしているのにその餌を食べない愚か者に映ってしまう

その結果，やる夫はほとんど学校にこなくなってしまった
ただ幸運ともいうべきであろうか．少なくともやる夫と同学区の同世代は戦友とも言える絆を持っていた
同じ学区の人間は勝手知ったる地域なので別に集まるのは学校である必要はない
彼らはそれぞれお互いの家などを用いてやる夫を悪意や害意から守ることにした
彼らの胸にあったのは「このゲームで一番つええ奴が1日やる夫と遊べる」という不文律．それは彼らの明確なルールだった

しかし人間は不公平感に不満を抱くものである
他学区の女子生徒1「ねえ，やる夫くんって今日も来てないの？」
他学区の女子生徒2「そうらしいよ．先生が言うには気分がすぐれないんだって」
他学区の女子生徒1「でも，この前Aと駅前で買い物してるの見たよ」
他学区の女子生徒2「え？じゃあほんとは体調なんて崩してないってこと？」
他学区の女子生徒1「しかもやる夫くんと遊んでるのあの学区の人ばっかりじゃない」
他学区の女子生徒2「そう言われてみれば，そうね」
他学区の女子生徒1，2「「そんなのずるい」」

ｙ「はあ，やっぱりこうなったかお．みんなは，なんでもないような顔をしているけど無理をしているのはなんとなくわかるお．」

庇ってくれる人間が減ったりいなくなっていったわけではない
だが中座する回数が増えたり自分から見えてないと思って深刻な表情を浮かべることが多くなった同級生を思い独りごちた
まあ，このまま行かなくてもいいか．その間にじぶんがやりたいことを探そう，と思っていたところに
幼馴染「やる夫！無事か！」
顔面蒼白な幼なじみがやってきた

ｙ「お！？どうしたんだお？！」
お「よかった．．．生きてる．．．本物だよな？夢じゃないよな？」
ｙ「勝手に殺すな！」
その言葉を聞くと安心したのか泣き出す幼馴染
お「よがっだよ”おおお．．．ごめ”んな”あ”あ”あ”」
ｙ「え？え？なにがどうなってるお？」
やる夫が困惑してると幼馴染が壊した扉から複数の人間が現れた
幼馴染2「ほんとにやる夫のことになると向こう水なんだから．あとでおばさんに謝らなきゃ」←TCG地元最強
幼馴染3「そんなこといって一番狼狽えてたの　お2　じゃん」←FPS上位勢
幼馴染4＆5「そう言ってる　お3　が一番カバン片付けるの早かったぞー」ぞー」←お3と同じチームのFPS強者．MOBAでも好成績
ｙ「え？みんな？なんで？」

困惑するやるおはとりあえず目の前で泣きじゃくってる幼馴染をなだめることから始めるしかなかった

ｙ「で，やる夫が自殺するんじゃないかと思ったと」
お「ﾊｲ．．．」
最近やる夫が学校に来てない，違う学区のやつからの評判が悪い，自分たちとの連絡もおざなりになってしまった，という情報がネガティヴ合体した結果こう言った勘違いが起きてしまった
考えすぎ，と前の自分なら笑い飛ばしていただろう
しかしその可能性がないとは言い切れないという事実がこの世界の異常さを改めてやる夫に突きつけることになった

ｙ「．．．大丈夫だお，初めての人が多かったからちょっと疲れただけだお」
お「本当だな！信じるぞ！嘘ついたらゆるさないからな！」
そうやって怒る幼馴染の目にはまだ涙が残っている
お3「でもこうやって集まるのは久しぶりなのも事実だよ」
お2「そうね，私達が共学対策し始めてからだと初めてじゃないかしら」
お4「アタシたちは学校も違うからなー，この顔ぶれが懐かしいと感じるぞ．ばあさんやご飯はまだですかのう」
お5「ご飯は一昨日食べたでしょ」
ｙ「え？おまいらも共学目指してるのかお？」
お2「当たり前じゃない，そうじゃないとやる夫と遊ぶ時間が減るでしょ」
お3「ボクたちの目標はやる夫と一日中遊ぶことだからね」
お4「勝ち逃げは許さないぞー」
お5「共学にある最高級設備でやるゲームも味わってみたいし」

意外だった．少しまえまで自分とただ楽しく遊んでいた幼馴染たちが将来を考えていることも，そこまで自分と遊びたがっていることも

お「母ちゃんから許しも出たし，明日から連休だし今日はひさびさに遊ぼうぜ！」
お2「今夜は寝かさないわよ〜」

遊び疲れ．一休みしている時にやる夫は今まで抱えていたモヤモヤを打ち明けた
ｙ「やる夫も何かできればいいんだけど」
お「どういう意味だ？」
ｙ「みんなが目標に向かっているのを見てずっと考えてたんだお．自分も何かやりたいって．でもやる夫は男だからやれることにも限りがあって，けどみんなと遊んでいたいし，負担になりたくない．やる夫は何かしたいんだけど何をすべきなのかわからないんだお」
お3「やる夫．．．」

お4「みんなピザ食べないのか？いらないなら二人で食べるけど」
お5「おばさんが今日は好きに頼んでいいっていうからたくさん頼んだんだけど」
ずっこける3人
お「おまえらなあ．．．」

お4「なんか変に悩んでるみたいだけど，好きなことをすればいいと思うぞ」
お5「そうそう，アタシたちはやる夫と遊ぶのが好きだから，いっぱい遊ぶのに必要だから共学目指してるだけだぞ．美味しいおやつをもらうためにはいっぱいお使いしなきゃいけないのとおんなじ」

ｙ「そんなものかお」
お4「そんなものだぞ．あと人生なんとかなるけど，なるようにしかならないってお母さんも言ってたし」
ｙ「．．．そうかお．じゃあ，今日はいっぱい遊ぶお！」
お5「よーしこれから，桃鉄999年やるぞ」
現在21：00である
ｙ「あれ？大丈夫かな？」

ちなみに
O母「（．．．やっぱりこうなりましたか）お，明日は休みにします．やる夫君のところにいってあげなさい．そんなに集中できないなら時間の無駄です」（落ち込んでいる男子を励ましたというエピソードは面接でプラスに働きます．それに何より．．．目的を改めて意識するだけでなく危機感を覚えるにはちょうどいいです）←超大手弁護士事務所の稼ぎ頭
お2母「とかなんとか言って悪ぶっていたのに心配になってうちで飲みに来ちゃうあたり，甘々よね」←居酒屋経営
O母「だってだって〜やる夫くんほんとにいい子なんだもーん．わたしの誕生日に折り紙でメダル作ってくれたり，ｍイクラで祝ってくれたりしてくれたんだもーん」
お3母「確かに娘に頼まれたくらいじゃあんなガチなルール作らないわよね」←地元の警察官を束ねる警察署長
ｙ母「実の親の私よりも可愛がっているんじゃないかしら」←地域密着不動産屋経営
お4母「幼馴染が共学目指したいって言ってた時も足どころか体まで浮かぶくらい浮かれてたものね．幼馴染ちゃんが後輩になる！って」
親の心どころか醜態も子知らず，である

そんなこんなで夜も更けたころ6人は今後のことについて話あった
お「やる夫が元気なのはわかったけどよーやっぱり学校は行かなくてもいいんじゃねえか？」
お2「そうね，やる夫のことを悪く言ってる人だって若い美空で将来を棒に振るほどバカじゃないと思うわ」
お3「でもボクたちもずっと見てられるわけじゃないしね，家にいてもらっても構わないけどそれだとボクたちのべんん今日で構えないし」そんなこんなで夜も更けたころ6人は今後のことについて話あった
お「やる夫が元気なのはわかったけどよーやっぱり学校は行かなくてもいいんじゃねえか？」
お2「そうね，やる夫のことを悪く言ってる人だって若い美空で将来を棒に振るほどバカじゃないと思うわ」
お3「でもボクたちもずっと見てられるわけじゃないしね，家にいてもらっても構わないけどそれだとボクたちのべんん今日で構えないし」

